УТ/src/Catalogs/CRM_ВнешниеБиблиотеки/CRM_ВнешниеБиблиотеки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ВнешниеБиблиотеки</name>
  <predefined>
    <items>
      <name>БиблиотекаОтображенияГрафиков</name>
      <description>Библиотека отображения графиков (d3.js)</description>
    </items>
    <items>
      <name>БиблиотекаОтображенияГрафиковLinux</name>
      <description>Библиотека отображения графиков для ОС Linux (d3.js)</description>
    </items>
  </predefined>
  <attributes>
    <name>БиблиотекаСовместимости</name>
    <type>
      <types>CatalogRef.CRM_ВнешниеБиблиотеки</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМакетаВерсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерБиблиотеки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеАрхиваБиблиотеки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеБиблиотеки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ВнешниеБиблиотеки/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура выполняет заполненеие предопределенных внешних библиотек.
//
Процедура ЗаполнитьПредопределенныеВнешниеБиблиотеки() Экспорт
	
	ОбъектСправочника = Справочники.CRM_ВнешниеБиблиотеки.БиблиотекаОтображенияГрафиков.ПолучитьОбъект();
	ОбъектСправочника.НаименованиеМакетаВерсии	= "БиблиотекаОтображенияГрафиков";
	ОбъектСправочника.БиблиотекаСовместимости	= Справочники.CRM_ВнешниеБиблиотеки.БиблиотекаОтображенияГрафиковLinux;
	ОбъектСправочника.Записать();
	
	ОбъектСправочника = Справочники.CRM_ВнешниеБиблиотеки.БиблиотекаОтображенияГрафиковLinux.ПолучитьОбъект();
	ОбъектСправочника.НаименованиеМакетаВерсии	= "БиблиотекаОтображенияГрафиковСовместимость";
	ОбъектСправочника.Записать();
	
КонецПроцедуры // ЗаполнитьПредопределенныеВнешниеБиблиотеки()

#КонецОбласти
